# Rolling sum salary

Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082

The following table shows the monthly salary for an employee for the first nine months in a given year. From this, write a query to return a table that displays, for each month in the first half of the year, the rolling sum of the employeeâ€™s salary for that month and the following two months, ordered chronologically.

In [1]:
%load_ext sql
%sql postgresql://fknight:@localhost/postgres

In [2]:
%%html
<style>
table {float:left}
</style>

## The `salaries` table

In [3]:
%%sql

DROP TABLE IF EXISTS salaries;
CREATE TABLE salaries (
    month INT,
    salary MONEY
);

INSERT INTO salaries
VALUES
    (1, 2000),
    (2, 3000),
    (3, 5000), 
    (4, 4000), 
    (5, 2000), 
    (6, 1000), 
    (7, 2000), 
    (8, 4000), 
    (9, 5000);

SELECT * FROM salaries;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
9 rows affected.
9 rows affected.

[(1, '$2,000.00'),
 (2, '$3,000.00'),
 (3, '$5,000.00'),
 (4, '$4,000.00'),
 (5, '$2,000.00'),
 (6, '$1,000.00'),
 (7, '$2,000.00'),
 (8, '$4,000.00'),
 (9, '$5,000.00')]

## The expected output

| month | salary_3mos |
|------ |------------ |
| 1     | 10000       |
| 2     | 12000       |
| 3     | 11000       |
| 4     | 7000        |
| 5     | 5000        |
| 6     | 7000        |

# Type your SQL below

In [ ]:
# %%sql
#
# Type your query here